:PROPERTIES:
:ID:       386bac1f-f9d0-4175-b9c4-f8cadae238fc
:END:
#+TITLE: The book of records
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-20 Sat 07:28]
| Headline                 | Time   |
|--------------------------+--------|
| *Total time*             | *1:23* |
|--------------------------+--------|
| 2.15 The book of records | 1:23   |
#+END
* 2.15 The book of records
:LOGBOOK:
CLOCK: [2024-04-19 Fri 05:40]--[2024-04-19 Fri 07:03] =>  1:23
:END:
*Consider a sequence of random numbers* \(\left\{x_{1}, x_{2}, \cdots, x_{n}, \cdots\right\}\); *the entry* \(x_{n}\) *is a record if it is larger than all numbers before it, i.e. if* \(x_{n}>\left\{x_{1}, x_{2}, \cdots, x_{n-1}\right\}\). *We can then define an associated sequence of indicators* \(\left\{R_{1}, R_{2}, \cdots, R_{n}, \cdots\right\}\) *in which* \(R_{n}=1\) *if* \(x_{n}\) *is a record, and* \(R_{n}=0\) *if it is not (clearly* \(R_{1}=1\) *)*.

Next: [[id:71074a92-d485-49e0-b3e7-4adb0098106f][Jarzynski equality]]

** 2.15.1
*Assume that each entry* \(x_{n}\) *is taken independently from the same probability distribution* \(p(x)\). *In other words,* \(\left\{x_{n}\right\}\) *are IIDs (independent identically distributed). Show that, irrespective of the form of* \(p(x)\), *there is a very simple expression for the probability* \(P_{n}\) *that the entry* \(x_{n}\) *is a record.*

Given that \(\left\{x_n\right\}\) are IIDS, \(p\left(x_n \mid x_m\right)=p\left(x_n\right)\). With just this fact, the maximally disperse PDF is the uniform. For the \(n^{\text {th }}\) entry \(P_n= n^{-1}\).

** 2.15.2
*The records are entered in the Guinness Book of Records. What is the average number* \(\left\langle S_{N}\right\rangle\) *of records after* \(N\) *attempts, and how does it grow for* \(N \gg 1\) *? If the number of trials, e.g., the number of participants in a sporting event, doubles every year, how does the number of entries asymptotically grow with time.*

\begin{align*}
\langle S_N \rangle =\sum_{n=1}^N P_n = \sum_{n=1}^N n^{-1} \approx \ln N+\gamma, \qquad N \gg 1.
\end{align*}

where

\[\gamma \equiv \lim _{n \rightarrow \infty} \bigg(-\ln (n)+\sum_{k=1}^n 1 / k\bigg),\]

the Euler-Mascheroni contant. Participant doubling on a yearly basis mean the number of participants in the \( t^{\text{th}} \) year is \(\propto 2^t\), so that \(\langle S_N\rangle \approx t \ln (2) + \gamma\) for \(N \gg 1\).

** 2.15.3
*Prove that* \(\left\langle R_{n} R_{m}\right\rangle_{c}=0\) *for* \(m \neq n\). *(The record indicators* \(\left\{R_{n}\right\}\) *are in fact independent random variables, though not identical, which is a stronger statement than the vanishing of the covariance.)*

The cumulant \( \langle R_n R_m \rangle_c \) can be calculated from the moments as \( \langle R_n R_m \rangle_c = \langle R_n R_m \rangle - \langle R_n \rangle \langle R_m \rangle \) where \(\langle R_n \rangle = P(R_n = 1) = n^{-1} \), \(\langle R_m \rangle = P(R_m = 1) = m^{-1}\), and \(\langle R_n R_m \rangle = P(R_{n}=1 \wedge R_{m} = 1)\). Without loss of generality, let \(m < n\). For the event \(R_m = 1 \wedge R_n = 1\) to occur 1) \(x_m\) must be the largest among \(x_1, ..., x_m\), 2) \(x_n\) must be the largest overall, independent of \(x_m\)’s status. Thus \( \langle R_n R_m \rangle = 1 \cdot P(R_n = 1 \wedge R_m=1) = (nm)^{-1} \). It is then clear that \( \langle R_n R_m \rangle_c = (nm)^{-1} - n^{-1}\,m^{-1} = 0 \).

** 2.15.4
*Compute all moments, and the first three cumulants of the total number of records* \(S_{N}\) *after* \(N\) *entries. Does the central limit theorem apply to* \(S_{N}\) *?*

Let \( S_N = \sum_{n=1}^N R_n \), where \( R_n \) is the indicator random variable for records, i.e., \( R_n = 1\) if \(x_n\) is a record, otherwise \( R_n = 0 \). By virtue of being an indicator random variable, \( R_n \) satisfies the property \( \langle R_n^m \rangle = n^{-1} \) for any positive integer  \( m \). Hence, the cumulants are easily obtained using the moments

\begin{align*}
\langle S_N \rangle_c &= \sum_{n=1}^N \langle R_n \rangle_c = \sum_{n=1}^N n^{-1}, \\
\langle S_N^2 \rangle_c &= \sum_{n=1}^N \langle R_n^2 \rangle_c = \sum_{n=1}^N (n^{-1} - n^{-2}), \\
\langle S_N^3 \rangle_c &= \sum_{n=1}^N \langle R_n^3 \rangle_c = \sum_{n=1}^N (n^{-1} - 3 n^{-2} + 2 n^{-3}).
\end{align*}

The characteristic function for \( S_N \), in terms of the characteristic function of \( S_{N-1} \) is

\begin{align*}
\langle \exp(-i k S_N) \rangle &= N^{-1} \big[ \exp(-i k) \langle \exp(-i k S_{N-1}) \rangle + (N-1) \langle \exp(-i k S_{N-1}) \rangle \big] \\
&= N^{-1} (\exp(-i k) + N-1) \langle \exp(-i k S_{N-1}) \rangle.
\end{align*}

Utilizing the base case \( S_1 = 1 \), or \( \langle \exp(-i k S_1) \rangle = \exp(-i k) \), we can use this recursive relation to find the characteristic function for any \( N \)

\[
\langle \exp(-i k S_N) \rangle = (N!)^{-1} \prod_{n=1}^N (\exp(-i k) + n - 1).
\]

Approximately, this expands as:

\[
\langle \exp(-i k S_N) \rangle = (N!)^{-1} \sum_{n=0}^N \mathrm{S}_1 (N, n) \exp(-i k n),
\]

where \( \mathrm{S}_1 (N, n) \) is the /unsigned Stirling number of the first kind/. On expanding \( \exp(-i k n) \) in a Taylor series in \( k \) about \( k = 0 \)

\begin{align*}
\cdot\left\langle\exp \left[-i k S_N\right]\right\rangle & = (N!)^{-1} \sum_{n=0}^N \mathrm{S}_1 (N, n) \sum_{m=0}^{\infty} \frac{n^m(-i k)^m}{m !} \\
& =\sum_{m=0}^{\infty} \frac{(-i k)^m}{m !}\left[(N!)^{-1} \sum_{n=0}^N \mathrm{S}_1(N, n) n^m\right],
\end{align*}

we can read off the moments of \( S_{N} \)

\begin{align*}
\langle S_N^m\rangle= (N!)^{-1} \sum_{n=0}^N \mathrm{S}_1(N, n) n^m.
\end{align*}

** 2.15.5
*The first record, of course, occurs for* \(n_{1}=1\). *If the third record occurs at trial number* \(n_{3}=9\), *what is the mean value* \(\left\langle n_{2}\right\rangle\) *for the position of the second record? What is the mean value* \(\left\langle n_{4}\right\rangle\) *for the position of the fourth record?*

\(n_2\) can take values from 2 to 8 . Let \(n_2=n, 2 \leqslant n \leqslant 8\). We have \( P(R_n=1)= n^{-1} \) and \( P(R_n=0)=1- n^{-1} \). Therefore

\[
p\left(n_2=n\right)=\frac{1}{1} \cdot \frac{(n-3)}{(n-2)} \cdot \frac{(n-2)}{(n-1)} \cdots \frac{1}{n} \cdot \frac{n}{(n+1)} \cdot \frac{(n+1)}{(n+2)} \cdots \frac{1}{8} \cdot \frac{1}{9} = \frac{1}{72(n-1)}.
\]

\[
\langle n_2 \rangle = \bigg(\sum_{n_2=2}^8 n_2 \cdot \frac{1}{72(n_2-1)} \bigg) \bigg(\sum_{n_2=2}^8 \frac{1}{72(n_2-1)} \bigg)^{-1} = 1343/363 \approx 3.7.
\]
